IDEA StatiCa Open Model
DistanceComparison Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Represents the result of comparison of distances of two object from the same point
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum DistanceComparison
Public Enumeration DistanceComparison
public enum class DistanceComparison
Members
Member name | Value | Description
Closer | 0 |  Closer
Farther | 1 |  Farther
Same | 2 |  Same
See Also
Reference
IdeaRS.OpenModel.Connection Namespace